---
type: InsertableObject
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# InsertableObject

`Autodesk.Revit.DB.InsertableObject` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |